_Rarzrabotki/Kazna/InformationRegisters/ПараметрыОплатыСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыОплатыСчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ПараметрыОплатыСчетов/Ext/ManagerModule.bsl
Функция ПолучитьПроцентОплаты(Контрагент, СтатьяДДС)Экспорт  
	Если НЕ ЗначениеЗаполнено(Контрагент) ИЛИ Не ЗначениеЗаполнено(СтатьяДДС) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст=   "ВЫБРАТЬ
	                |	ПараметрыОплатыСчетов.ПроцентОплаты,
	                |	ПараметрыОплатыСчетов.Контрагент,
	                |	ПараметрыОплатыСчетов.СтатьяДДС,
	                |	ВЫБОР
	                |		КОГДА ПараметрыОплатыСчетов.Контрагент = &Контрагент
	                |				И ПараметрыОплатыСчетов.СтатьяДДС = &СтатьяДДС
	                |			ТОГДА 1
	                |		КОГДА ПараметрыОплатыСчетов.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                |				И ПараметрыОплатыСчетов.СтатьяДДС = &СтатьяДДС
	                |			ТОГДА 3
	                |		КОГДА ПараметрыОплатыСчетов.Контрагент = &Контрагент
	                |				И ПараметрыОплатыСчетов.СтатьяДДС = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	                |			ТОГДА 2
	                |		КОГДА ПараметрыОплатыСчетов.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                |				И ПараметрыОплатыСчетов.СтатьяДДС = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	                |			ТОГДА 5
	                |		ИНАЧЕ 9
	                |	КОНЕЦ КАК Приоритет
	                |ИЗ
	                |	РегистрСведений.ПараметрыОплатыСчетов КАК ПараметрыОплатыСчетов
	                |ГДЕ
	                |	(ПараметрыОплатыСчетов.СтатьяДДС = &СтатьяДДС
	                |			ИЛИ ПараметрыОплатыСчетов.Контрагент = &Контрагент
	                |			ИЛИ ПараметрыОплатыСчетов.СтатьяДДС = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	                |			ИЛИ ПараметрыОплатыСчетов.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Приоритет";  
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("СтатьяДДС",СтатьяДДС);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентОплаты;
	Иначе 	
	      Возврат 0;
	КонецЕсли;
	
	
КонецФункции // ()
